analysis/tests/Go_gin_test_auth.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.27.1
Server Hostname:        localhost
Server Port:            8020

Document Path:          /auth/login
Document Length:        127 bytes

Concurrency Level:      10
Time taken for tests:   8.332 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      292000 bytes
HTML transferred:       127000 bytes
Requests per second:    120.02 [#/sec] (mean)
Time per request:       83.319 [ms] (mean)
Time per request:       8.332 [ms] (mean, across all concurrent requests)
Transfer rate:          34.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    64   82  16.1     79     163
Waiting:       64   82  16.1     79     163
Total:         64   82  16.1     79     163

Percentage of the requests served within a certain time (ms)
  50%     79
  66%     85
  75%     90
  80%     94
  90%    105
  95%    113
  98%    122
  99%    133
 100%    163 (longest request)


This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.27.1
Server Hostname:        localhost
Server Port:            8020

Document Path:          /auth/login
Document Length:        127 bytes

Concurrency Level:      100
Time taken for tests:   8.247 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      292000 bytes
HTML transferred:       127000 bytes
Requests per second:    121.26 [#/sec] (mean)
Time per request:       824.661 [ms] (mean)
Time per request:       8.247 [ms] (mean, across all concurrent requests)
Transfer rate:          34.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       3
Processing:    66  799 290.3    772    1981
Waiting:       63  799 290.3    772    1981
Total:         66  800 290.3    772    1981

Percentage of the requests served within a certain time (ms)
  50%    772
  66%    904
  75%   1011
  80%   1064
  90%   1187
  95%   1304
  98%   1421
  99%   1587
 100%   1981 (longest request)